[
  {
    "header_value": "1949",
    "photo": "",
    "body": "<p>Pacific Southwest Airlines began initial operations on May 6, 1949, flying a leased DC-3 aircraft with a seating capacity of 31 once a week between San Diego and Oakland via Hollywood/Burbank.</p><p>Original fares for the three-city route structure were: SAN-OAK $15.60, SAN-BUR $5.65, and BUR-OAK $9.95.</p><p>By the end of 1949, PSA was operating two DC-3s and had carried 15,011 revenue passengers over 321,112 plane miles. The airline posted operating revenues of $172,796 against operating expenses of $160,902 for a net profit of $11,984.</p>"
  },
  {
    "header_value": "1950",
    "photo": "",
    "body": "<p>PSA operated over the same three destination route structure in 1950. Revenue passenger totals tripled as the airline carried 45,390 travelers.</p><p>While operating revenues advanced to $503,737, operating expenses increased to $517,334 and a net loss of $8,597 was posted for the year.</p>"
  },
  {
    "header_value": "1951",
    "photo": "",
    "body": "<p>PSA added a fourth destination in July 1951 with the initiation of service to San Francisco from San Diego, and Burbank at fares of $17.25 and $11.70 respectively.</p><p>PSA flew 1,162,678 plane miles, carried 75,995 revenue passengers and posted a net profit of $6,093. At year's end the number of people employed had increased from the original 50 to 119 with annual payroll of $366,605.</p>"
  },
  {
    "header_value": "1952",
    "photo": "",
    "body": "<p>PSA's fleet of DC-3's increased to four in 1952 as the airline continuted to serve San Diego, Hollywood/Burbank, Oakland and San Francisco.</p><p>PSA carried 92,484 revenue passengers and logged operating revenues of $1,125,364 against operating expenses of $1,151,972 for a $26,608 net loss.</p>"
  },
  {
    "header_value": "1953",
    "photo": "",
    "body": "<p>During 1953, service was inaugurated from San Diego and Hollywood/Burbank to Long Beach with fares of $4.80 and $2.25 respectively.</p><p>For the year, PSA posted a net loss of $37,577 based on operating revenues of $1,454,413 and operating expenses of $1,491,990.</p><p>PSA carried 115,028 revenue passengers and flew 1,877,903 plane miles. The number of employees increased to 190 with an annual payroll of $521,967.</p>"
  },
  {
    "header_value": "1954",
    "photo": "",
    "body": "<p>In 1954, PSA discontinued operations at Oakland and Long Beach and reverted to a three city route structure, serving the cities of San Diego, San Francisco, and Hollywood/Burbank. Fares were as follows: SAN-SFO $19.05, BUR-SFO $13.50, and SAN-BUR $5.45.</p><p>The number of revenue passengers decreased by approximately 13,000 from the previous year as PSA carried a total of 102,124 passengers. However, the airline posted a net profit of $26,711.</p>"
  },
  {
    "header_value": "1955",
    "photo": "",
    "body": "<p>PSA purchased two McDonnell-Douglas DC-4 aircraft in 1955 to replace its DC-3 equipment. The larger, faster DC-4's were configured to carry 70 passengers, more than twice that of the older DC-3s.</p><p>As profit rose, fares went down. The $19.05 SAN-OAK fare dropped to $15.44, the BUR-SFO fare was lowered from $13.50 to $9.99 while the SAN-BUR fare remained unchanged at $5.45. These fares remained constant through 1958.</p>"
  },
  {
    "header_value": "1956",
    "photo": "",
    "body": "<p>The airline added a third DC-4 to its fleet in 1956 and carried 191,221 revenue passengers over a three city route structure. Operating revenues and operating expenses increased to $2,122,376 and $2,063,788 respectively. Continuing a three year trend of year end profits, PSA earned $58,588 for the year.</p>"
  },
  {
    "header_value": "1957",
    "photo": "",
    "body": "<p>In 1957, a fourth DC-4 was added to PSA's fleet of aircraft and the airline's employees increased to 246 with an annual payroll of $762,294.</p><p>Revenue passenger totals increased to 256,454 as PSA posted a profit of $196,606.</p>"
  },
  {
    "header_value": "1958",
    "photo": "",
    "body": "<p>August marked the inauguration of service to Los Angeles International Airport and, once again, the number of destinations in PSA's system increased to four. The SAN-LAX fare was the same as SAN-BUR $5.45. Fares for LAX-SFO and BUR-SFO were set at $11.81 and the SAN-SFO fare rose to $17.26.</p><p>In 1958, PSA carried 295,818 revenue passengers and flew 1,935,465 plane miles as it posted a year end profit of $322,031.</p>"
  },
  {
    "header_value": "1959",
    "photo": "",
    "body": "<p>The introduction of three Lockheed L-188 Electra propjets into PSA's fleet highlighted 1959. The 98 seat aircraft were ideally suited to the airlines four destination route structure and revenue passengers increased to 355,099 while plane miles exceeded the 2 million mark for the first time.</p><p>PSA posted operating revenues of $4,362,921 against operating expenses of $3,907,015 for a net profit of $455,906.</p><p>In 1959, PSA employed 300 and the annual payroll exceeded $1 million.</p>"
  },
  {
    "header_value": "1960",
    "photo": "",
    "body": "<p>Disposing of its DC-4 equipment, PSA entered the 1960s with a fleet that consisted of three Electras and one 92 seat DC-6.</p><p>Available seat miles, plane miles and revenue passengers increased to 289,100,00, 2,950,000, and 621,280 respectively.</p><p>PSA reinstated service to Oakland in October, but discontinuted again in March 1961. Fares remained at 1958 levels as the airline posted a year end profit of $499.</p>"
  },
  {
    "header_value": "1961",
    "photo": "",
    "body": "<p>With the disposition of the DC-6 and the addition of another Electra, PSA's 1961 fleet stood at four Electra propjets.</p><p>The airline flew 713,064 revenue passengers over 3.3 million aircraft miles. Operating revenues increased to $9.7 million and a year end profit of $310,483 was posted.</p>"
  },
  {
    "header_value": "1962",
    "photo": "",
    "body": "<p>A fifth Electra was added to the fleet as PSA's revenue passenger totals exceeded the 1 million mark for the first time. PSA carried 1,032,514 revenue passengers over its four city route structure and enjoyed its best year to date, showing a profit of $1,368,770.</p>"
  },
  {
    "header_value": "1963",
    "photo": "",
    "body": "<p>PSA operated a fleet of six Electra aircraft in 1963, a figure that would remain constant through the following year.</p><p>The airline flew 5.5 million plane miles and carried 1,305,058 revenue passengers, up 272,544 over the previous year. PSA posted operating revenues of $17,432,534 against operating expenses of $15,180,815 for a net profit of $2,251,719.</p><p>On February 13, 1963, Pacific Southwest Airlines became a public corporation.</p>"
  },
  {
    "header_value": "1964",
    "photo": "",
    "body": "<p>PSA earned a net profit of $2,945,881 based on operating revenues of $20,455,295 and operating expenses of $17,509,414 for the year. The airline carried 1,532,243 revenue passengers and flew 6.5 million plane miles over a four city route system.</p>"
  },
  {
    "header_value": "1965",
    "photo": "",
    "body": "<p>In 1965, PSA entered the jet age as it added five Boeing 727-100s to its fleet of six Electras. The Boeing aircraft were configured to seat 128 passengers.</p><p>With the introduction of jet equipment into its fleet, PSA's available seat miles increased to nearly 1 billion as the airline carried 1,863,088 revenue passengers and earned a profit of $2,034,932.</p><p>In January, PSA again initiated service to Oakland. On June 21, the airline was listed on the New York Stock Exchange.</p>"
  },
  {
    "header_value": "1966",
    "photo": "",
    "body": "<p>PSA added two more Boeing 727-100 aircraft to the fleet during 1966, bringing the fleet total to six Electras and seven Boeing 727's. With this equipment, PSA nearly doubled its revenue passenger totals as it carried 2,712,811 travelers and posted a net profit of $4,307,289 based on operating revenues of $32.9 million and operating expenses of $28.6 million.</p><p>In May, PSA inaugurated routes between San Diego/Los Angeles/Burbank and San Jose and offered fares of $19.85, $13.50, and $13.50 respectively.</p>"
  },
  {
    "header_value": "1967",
    "photo": "",
    "body": "<p>During 1967, the airline added three more jet aircraft to the fleet, a Boeing 727-100 and two McDonnell Douglas DC-9s. The Douglas aircraft were configured to carry 110 passengers.</p><p>By the end of the year, the six Electras were phased out of the fleet and PSA became an all jet airline.</p><p>Revenue passengers increased to 3,346,484 as PSA earned a year end profit of $4,159,823. In February, PSA inaugurated service to Sacramento wit a SAN-SMF fare of $21.59 and a LAX-SMF fare of $15.24.</p>"
  },
  {
    "header_value": "1968",
    "photo": "",
    "body": "<p>During 1968, PSA augmented its fleet of seven 727-100s and two DC-9s with seven 727-200 aircraft and four 737-200 aircraft. By years end the fleet total of jet aircraft stood at 20.</p><p>The new stretched 727's were configured for 159 passengers and the twin-engine 737's held 114 passengers.</p><p>PSA carried 3,997,524 revenue passengers over a system that included seven California destinations with Ontario becoming the eighth when service was inaugurated in June.</p><p>In 1968, PSA employed 1,889 with an annual payroll of $13.6 million. The airline earned $4 million on operating revenues of $56.2 million and operating expenses of $52.2 million.</p>"
  },
  {
    "header_value": "1969",
    "photo": "",
    "body": "<p>PSA's 1969 fleet consisted of one DC-9, one Boeing 727-100, 14 Boeing 727-200s, and nine Boeing 737-200s. The airline's fare structure included the following: SAN-LAX, SAN-BUR, SAN-ONT, SFO-SMF $7.14; SAN-SFO, SAN-OAK, SAN-SJC $20.95; SAN-SMF $22.86; LAX-SFO, LAX-OAK, LAX-SJC, BUR-SFO, BUR-OAK, BUR-SJC $14.52; ONT-SFO $16.19, LAX-SMF $16.19</p> <p>PSA carried 4.4 million revenue passengers and posted a year end profit of $3,747,016.</p>"
  },
  {
    "header_value": "1970",
    "photo": "",
    "body": "<p>PSA entered the seventies with an all Boeing-equipped fleet that included one 727-100, 16 727-200s, and nine 737-200s.</p><p>The airline topped the 5 million mark in revenue passengers as it carried 5,162,278 and posted a net profit of $3.6 million.</p><p>PSA started up service again to Long Beach in December 1970. For the year, the airline flew 20.6 million plane miles and 2.9 billion available seat miles.</p>"
  },
  {
    "header_value": "1971",
    "photo": "",
    "body": "<p>PSA operated a fleet of 27 jet aircraft during 1971, which included 16 727-200s, one 727-100, and 10 737-200s.</p><p>Operating revenues were $86,182,885 while operating expenses were $81,943,550. A year end profit of $4,239,335 was posted as PSA carried 5.6 million revenue passengers, an increase of nearly half a million over the previous year.</p>"
  },
  {
    "header_value": "1972",
    "photo": "",
    "body": "<p>Service to Fresno and Stockton began in July 1972. Inaugural fares between LAX-FAT and LAX-SCK were $14.82 and $18.52 respectively. Fares between FAT-SCK, FAT-SFO, and SCK-SFO were $7.41, $10.19, and $7.41 respectively.</p><p>In 1972, PSA employed 2,594 with an annual payroll of $27 million.</p><p>For the year 1972, PSA topped the 6 million mark in revenue passengers. The airline carried 6,356,875 and recorded a profit of $5,957,485.</p>"
  },
  {
    "header_value": "1973",
    "photo": "",
    "body": "<p>PSA flew 23,063,794 plane miles and carried 6,356,875 revenue passengers with a fleet of 19 727-200 and eight 737-200 aircraft during 1973.</p><p>Employment reached 2,670 employees with a payroll of more than 30 million.</p><p>On November 15, the airline was struck for the first time in its history by the Teamster's Union. Approximately 600 maintenence personnel and 700 operations personnel observed picket lines as management and non striking personnel continued to operate approximately 60 percent of the airline's normal schedule.</p><p>The labor dispute was settled on December 23. However it wasn't until several months later that PSA resumed normal operations. During 1973, PSA's operations revenues topped the $100 million mark for the first time as a net profit of $627,123 was posted.</p>"
  },
  {
    "header_value": "1974",
    "photo": "",
    "body": "<p>In 1974, PSA took delivery of two Lockheed L-1011 TriStars. The wide bodied aircraft were configured for 296 passengers and were initially introduced on the heavily traveled Los Angeles-San Francisco route. However, a recessionary economy and government inforced fuel quotas resulted in the new generation aircraft being grounded in early 1975.</p><p>For the year, PSA carried 6,381,197 revenue passengers and recorded a profit of $1,589,627 based on operating revenues of 123.4 million and operating expenses of $120.1 million.</p>"
  },
  {
    "header_value": "1975",
    "photo": "",
    "body": "<p>PSA added a 12th destination to its route structure in April when service was inaugurated to South Lake Tahoe. The LAX-TVL fare was set at $30. To serve Tahoe, PSA added two Lockheed Electras to its fleet of 23 727-200s, two 737-200s, one 727-100, and two grounded L-1011 aircraft.</p><p>During 1975, PSA had revenues of $152,521,000 and carried 6,436,436 revenue passengers. However, PSA, Inc. incurred a loss of $16.7 million resulting from the establishment of a provision for loss on the L-1011 aircraft program and a provision for anticipated losses on disposition on the company's subsidiary hotel and broadcasting operations.</p>"
  },
  {
    "header_value": "1976",
    "photo": "",
    "body": "<p>William R. Shimp became Chief Executive Officer upon the retirement of J. Floyd Andrews during 1976.</p><p>PSA sold the remaining two Boeing 737 aircraft and added two leased Boeing 727-100s, bringing the fleet to 23 727-200s, three 727-100s, two Lockheed Electra and two L-1011 aircraft. The two L-1011s remained grounded as the company sought a proscective buyer for the aircraft.</p><p>During the year, PSA continued the plan to dispose of subsidary hotel and broadcasting operations, selling the remaining radio stations and two of the four hotels.</p><p>PSA had earnings of $3,501,000 on revenues of $166,874,00 and carried 6,591,000 revenue passengers. Fares remained steady during 1976 with the Los Angeles-San Francisco fare $25.50.</p>"
  },
  {
    "header_value": "1977",
    "photo": "",
    "body": "<p>PSA applied to the Civil Aeronautics Board (CAB) for service from California cities to Las Vegas and Reno, at fares from 18 to 43 percent less than fares currently being charged.</p><p>If approved, the Nevada service would become the first interstate routes for the airline.</p><p>In December, PSA received permanent authority from the California Public Utilites Commission to serve South Lake Tahoe from Southern California and San Francisco.</p><p>The airline took delivery of five used Boeing 727-100 aircraft, two of which replaced leased 727-100s. The fleet now included 23 Boeing 727-200, six 727-100, four Lockheed Electra 188 and two Lockheed L-1011 aircraft, which remained grounded as the company sought prospective purchasers for the planes.</p>"
  },
  {
    "header_value": "1978",
    "photo": "",
    "body": "<p>After years of effort, PSA was finally granted approval by the CAB to serve interstate markets with authority between Oakland-Reno and San Diego-Las Vegas. One way fares on the Las Vegas-San Diego market were lowered by PSA to $30, a reduction of 35 percent from existing fares on the market.</p><p>While the new interstate service was the highlight of the year, PSA also faced tragedy, suffering its first fatal crash in the airline's history. On September 25, a PSA Boeing 727 and a privately owned Cessna 172 collided over San Diego, killing 144 people, including 37 PSA employees.</p><p>PSA's fleet of aircraft increased to 25 Beoing 727-200s, six Boeing 727-100s, four Lockheed Electra 188s, and two Lockheed L-1011s. An agreement to sublease the two L-1011s was reached late in the year with Lockheed Aircraft Company, which, in turn, leased the planes to Aero Peru.</p><p>PSA became the first domestic airline to order the new Douglas DC-9 Super 80 aircraft, the most quiet and fuel efficient commerical aircraft produced. A total of 12 aircraft were ordered for delivery in 1980 and '81.</p><p>Throughout the year, PSA continued its aggressive expansion plans with application to the CAB for service between California cities and Phoenix, Seattle, Salt Lake City, Portland, Houston, and seven cities in Mexico</p><p>During the year, PSA carried 7.8 million passengers and earned $11.5 million on revenues of $229.8 million.</p>"
  },
  {
    "header_value": "1979",
    "photo": "",
    "body": "<p>PSA's first full year as an interstate carrier was tremendously successful, with the airline carrying a record 8.6 million passengers and enjoying its best year ever financially.</p><p>PSA added Phoenix and Salt Lake City to the route system during the year, while dropping service to South Lake Tahoe and Monterey. At the end of 1979, PSA's route system included 15 cities in four states.</p><p>Although all of PSA's interstate routes were profitable within 90 days of the airline's inauguration of service, PSA's aggresive expansion plans were tempered somewhat by skyrocketing costs and limited quantities of aviation fuel.</p><p>Fuel also affected PSA fares throughout the system. By years end, PSA still was offering rates 35 percent below the national rate making formula, but the one-way PSA fares rose dramatically during the last half of the year, reflecting a doubling of fuel costs during that time period. Sample year-end fares: Los Angeles-San Francisco $46, Los Angeles-San Diego $26, Los Angeles-Las Vegas $38.</p><p>PSA's fleet of aircraft changed during the year, with the Lockheed Electra 188s once again phased out after the elimination of Lake Tahoe service. The airline received delivery of four new Boeing 727-200 aircraft and leased three Boeing 727-100s and one Boeing 727-200 to other airline companies. At years end, PSA's fleet included 27 Boeing 727-200s and 3 Boeing 727-100s.</p><p>The airline completed one major building and broke ground on another during 1979. A $2.5 million reservation center was opened in the Scripps Ranch Business Park in San Diego, while construction began on a multi-million dollar flight training facility adjacent to the reservations complex.</p><p>Financially, PSA enjoyed its best operating year in the history of the airline with operating revenues of $335,838,000 and earnings of $23,097,000.</p>"
  },
  {
    "header_value": "1980",
    "photo": "",
    "body": "<p>The year was one of \"firsts\" for PSA as the airline became an international carrier with service to Mexico, was shut down for the first time in its 32 year history by a strike, and became the first U.S. airline to operate the McDonnell Douglas Super 80 aircraft.</p><p>In April, PSA began service to Puerto Vallarta and Mazatlan, Mexico from Los Angeles, which meant that the airline had made full transformation from intrastate to interstate to international carrier in less than a year and a half.</p><p>PSA's pilots, represented by the Southwest Flight Crew Association, stuck the airline for 52 days, starting September 25, forcing PSA to halt scheduled service for the first time in its history.</p><p>The pilot's strike affected passenger volume and earnings for the year. Some 6 million passengers flew PSA during 1980 with PSA, Inc. reporting year end earnings of $12.6 million on revenues of $370,204,000.</p><p>PSA's fleet took on a \"Super\" look in December, with introduction of the nation's first Super 80 aircraft, a 153 seat plane that it touted as the \"World's Quietest Commercial Jetliner.\"</p><p>While the new Super 80 is quiet, the 30 percent improved fuel efficiency over PSA's Boeing 727s will help PSA to keep fare levels low in the face of rising fuel costs.</p><p>At the end of 1980, PSA was operating a fleet of 22 Boeing 727's and one Super 80.</p>"
  },
  {
    "header_value": "1981",
    "photo": "",
    "body": "<p align=\"left\">PSA's aggressive fleet transition program highlighted 1981 as the airline received 12 DC-9 Super 80 aircraft from McDonnell Douglas. </p> <p align=\"left\">The new plane's efficiencies, particularly in the area of fuel consumption, save PSA approximately $1.7 million per year over the aircraft it replaces. </p> <p align=\"left\">By year-end, PSA was operating a fleet of 13 Super 80s, 15 Boeing 727-200s and three Boeing 727-100 aircraft. </p> <p align=\"left\">With a major training program accompanying the delivery of the new aircraft, PSA opened a multi-million dollar training complex at the Scripps Ranch Business Park in San Diego. The center houses the nation's first DC-9 Super 80 simulator. </p> <p align=\"left\">A deepening recession and flight limitations imposed by the Federal Aviation Administration after the national strike by the Professional Air Traffic Controllers Organization had an adverse affect on PSA during the year. PSA boarded 6,077,000 passengers up 1.2 percent from 1980's figure. </p> <p align=\"left\">Although the airline operation lost $17 million during the year, profitable subsidiaries plus sale of aircraft and proceeds from safe harbor leasing, gave PSA, Inc. a record $28.5 million net income for the year. </p> <p align=\"left\">PSA entered three new cities during 1981, adding Orange County in October and Seattle and Tucson in December. In keeping with PSA's low-fare tradition, fares on the new markets were lowered below competitor's rates. </p>"
  },
  {
    "header_value": "1982",
    "photo": "",
    "body": "<p>PSA continued its fleet transition, adding eight more Super 80s during the year. By October, 21 Super 80s were online with nine Boeing 727s, thus making PSA the first major airline to operate a majority of its fleet with new-generation aircraft.</p><p>Passenger boardings were up 16.6 percent for the year. In 1982, PSA flew 7.1 million passeners. Available seat miles were the highest ever achieved and revenue passenger miles were the second highest in PSA history.</p><p>The economic recession did not abate and, as a result, earnings were adversely affected. Despite an airline operating loss, PSA, Inc. had year-end earnings of $19.5 million.</p><p>PSA improved its competitive position during the year by increasing service between California and Phoenix and at Burbank. In June, PSA reinstated the Midnight Flyer, late night, low fare service, which had been suspended in 1978. In September, service to Puerto Vallarta and Salt Lake City was discontinued.</p><p>The year ended with PSA entered into an agreement with Braniff Airways that would allow PSA to lease and purchase assets from the bankrupt carrier to form a new PSA division that would operate from its hub at Dallas-Fort Worth Regional Airport. Thirty repainted and reoutfitted Braniff Boeing 727s would be leased by PSA to serve 16 new cities, beginning in late Spring 1983.</p>"
  },
  {
    "header_value": "1983",
    "photo": "",
    "body": "<p>PSA abandoned its negotiations with Braniff early in the year when deadlines for the airline's agreement to be reached could not be met. PSA instead refocused its attention on markets in the West, and in Spring 1983 inaugurated service to Portland, Oregon; Spokane, Washington; and Albuquerque, New Mexico-the largest expansion in PSA's recent history.</p><p>PSA became the official airline of Disneyland under a 12 year agreement that includes several exclusive marketing ties and a PSA sponsored attraction at the famed theme park. Other major marketing developments were the introduction of the Executive Flyer program for frequent travelers. For the first time in the airline's history, seat assignments on all flights were initiated.</p><p>Competitive pressures abounded during 1983 from both established carriers and new entrants in PSA markets. Although PSA set records in 1983 for revenue passenger miles and available seat miles, PSA, Inc. reported a net loss of $9.3 million for the year.</p><p>Late in the year, PSA contracted with British Aerospace to acquire 20 new BAe 146-200 jets, 100 seat aircraft that will give PSA more flexibility to increase frequencies in existing markets and to consider expansion into new markets.</p><p>The 146, demonstrated to be the quietest commerical airliner on takeoff ever developed, also is extremely fuel efficient, buring about one half the amount of fuel as a Boeing 727-200.</p><p>Eight of the new generation planes were to be delivered to PSA by the end of 1984, at which time the 727s in the fleet would be phased out. The remaining 12 146s were set for delivery in 1985, and the contract with British Aerospace includes an option for an additional 25 aircraft.</p><p>At the end of the year, PSA's fleet included 25 Super 80s, eight Boeing 727s and four DC-9-30's.</p>"
  },
  {
    "header_value": "1984",
    "photo": "",
    "body": "<p>The year was dominated by measures to cut costs of the airline operation through continued fleet transition to more efficient aircraft and through negotiation of new, lower cost labor contracts with all employee groups.</p><p>Both were successful: By the end of the year, PSA was operating the most modern, fuel efficient and quiet fleet of any carrier in the country, and necessary concissions from employee groups had been approved.</p><p>The new labor contracts, in effect through 1987, offer all employees a 15 percent stock ownership in the airline and a profit sharing program equal to 15 percent of the airline's annual pre-tax profits. In exchange, the employee groups agreed to a 15 percent reduction in compensation and an equal increase in productivity. It was estimated that the new contracts would save PSA approximately $20 million a year in labor costs.</p><p>PSA took delivery in 1984 of its first six BAe 146-200 jets, named \"Smiliners,\" with the first revenue flight June 20 between Burbank and Oakland. A 26th Super 80 also was delivered, and PSA was able to substantially increase frequencies throughout its route system.</p><p>Eight Boeing 727s were sold or leased in 1984, with the last aircraft making its final flight in PSA's fleet on November 26. The workhorse of PSA for nearly 20 years, the 727s had logged in excess of 300 million miles and carried more than 92 million passengers in their career with PSA.</p><p>Several new customer conveniences were introduced in 1984. In January, PSA moved its operations at Los Angeles International Airport to the new PSA Terminal One, the first reached upon entering the busiest airport in PSA's system. Automatic check-in machines were installed at PSA's airports, reducing passenger congestion at the ticket counter, and the airline's Executive Flyer program was expanded to include affiliation with a worldwide carrier, TWA. In September, PSA reinstated nonstop service between Stockton and Los Angeles, offering the only all jet service between those cities.</p><p>Paul Barkley, president, was named chief executive officer in March, replacing William R. Shimp, who retained his position as chairman of the board. Shimp died of a heart attack on May 11 at age 59.</p><p>Financially, PSA, Inc. reported net income of $2.2 million on revenues of $689.7 million during the year.</p>"
  },
  {
    "header_value": "1985",
    "photo": "",
    "body": "<p>PSA ended 1985 with the largest single day expansion in the airline's history, inaugurating service December 19 at Eureka, California; Medford and Eugene, Oregon; Tri-Cities and Yakima, Washington; Boise, Idaho; and Cabo San Lucas, Baja California, Mexico. In October, PSA also became the first commerical jet carrier to begin service at Bellingham, Washington.</p><p>The expansion was possible with the addition in 1985 of 14 BAe 146s, completing the original order of 20. Fleet additions, including two Super 80s, also allowed PSA to substantially boost frequencies in existing markets. Most notably, the airline introduced the PSA Expressway, offering departures every half-hour between Los Angeles and San Francisco International airports, and more than tripled the number of daily PSA departures at Orange County Airport, where the exceptionally quite BAe 146 had qualified for additional flights. To accommodate the growth, service to Albuquerque was temporarily discontinued.</p><p>A number of consumer conveniences debuted in the year. All of PSA BAe 146s were reconfigured from 100 seats per aircraft to 85, making PSA the only airline in the West with a three/two seating arrangement for its entire fleet. The long awaited, premier position Terminal A at San Francisco International Airport also was opened, as was a new curbside terminal at Oakland. A second reservations center, located in Reno, was opened to help reduce costs and call-waiting.</p><p>A record number of passengers were boarded by PSA in 1985-more than 9 million-but fare wars provoked by new entrant, low cost competitors in several markets led to a $648,000 loss posted by the airline for the year. PSA, Inc., meanwhile, benefited from non airline activities and recorded a $28.8 million profit.</p><p>Russell L. Ray, Jr was named president and chief operating officer of the airline in August. Paul Barkley was named chairman of the board of the airline and remained as president and chief executive officer of PSA, Inc. J.P. Guerin was named chairman of the board of the holding company.</p>"
  },
  {
    "header_value": "1986",
    "photo": "",
    "body": "<p>This was a year of dramatic change for PSA, culminating in December with the announcement by PSA's parent company, PS Group, Inc. of an agreement to sell the airline to USAir Group Inc., the Washington DC based company that owns USAir.</p><p>The PSA announcement was only one in a long line of airline mergers, either completed or at least announced in 1986. As the industry underwent its largest consolidation in a single year, nearly all the big names were involved-Northwest/Republic, TWA/Ozark, Continental/Eastern/People Express, Delta/Western, Alaska/Jet America, and American/AirCal.</p><p>Shortly after American Airlines announced in November it was acquiring AirCal, USAir Group made its bid to purchase PSA for $17 per share of common stock. The boards of directors of PS Group and PSA concluded that the offer, which amounted to $400 million for the airline, was fair and agreed to the sale. At year's end, the agreement was still awaiting for approval from the US Department of Transportation, shareholders of PS Group and PSA and the various unions at PSA.</p><p>The airline took delivery during the year of two new MD Super 80s, bringing PSA's total fleet at years end to 55 aircraft-31 Super 80s, 20 BAe 146s, and four DC-9-30's. In May, PSA resumed service to Albuquerque, NM, and Monterey, California, and started service to Concord, California. Service to Redmond/Bend, Oregon began in October and seasonal service to Steamboat Springs, Colorado was added in December. Service was suspended during the year to Boise, Idaho, and Eureka, California. At years end, PSA's system included 30 cities in seven western states and Mexico.</p><p>PSA signed marketing agreements with Northwest Airlines in March and Air Canada in July. Under the agreements, PSA's schedule is coordinated with those of Northwest and Air Canada to enhance mutual traffic feed at Los Angeles, San Francisco, and Seattle international airports.</p><p>One million passengers flew PSA in the month of August marking the first time in the carrier's history that it boarded that many passengers in a single month.</p><p>PSA carried a record 10.7 million travelers in 1986, but posted a year end net loss of $3 million.</p>"
  },
  {
    "header_value": "1987",
    "photo": "",
    "body": "<p>On May 29, 1987 Pacific Southwest Airlines becomes a division of USAir.</p><p>PSA once again faced tragedy as the airline suffered the second fatal crash in its history. A recently discharged USAir employee boarded a BAe-146 aircraft operating as flight 1771 at Los Angeles on December 7, 1987 flying to San Francisco. The man carried a gun onboard, and fired several shots in or near the cockpit. The aircraft crashed near Harmony, California killing the crew of 5 and 37 additional passengers.</p>"
  },
  {
    "header_value": "1988",
    "photo": "",
    "body": "<p>The last PSA departure leaves San Diego, California as flight 1486 bound for Las Vegas, Nevada on April 8, 1988.</p>"
  }
]
