[
  {
    "header_value": "Ann Leonard",
    "photo": "",
    "date": "January 31, 2024",
    "body": ""
  },
  {
    "header_value": "Con Thrasher",
    "photo": "",
    "date": "January 16, 2024",
    "body": ""
  },
  {
    "header_value": "Elizabeth Markling",
    "photo": "",
    "date": "November 28, 2023",
    "body": ""
  },
  {
    "header_value": "Judy Corriea",
    "photo": "",
    "date": "October 17, 2023",
    "body": ""
  },
  {
    "header_value": "Dyan Salatino",
    "photo": "",
    "date": "September 1, 2023",
    "body": ""
  },
  {
    "header_value": "Capt. Jack Wilson",
    "photo": "",
    "date": "August 14, 2023",
    "body": ""
  },
  {
    "header_value": "Capt. Garry Weigand",
    "photo": "",
    "date": "July 1, 2023",
    "body": ""
  },
  {
    "header_value": "Carol Hill Leonard",
    "photo": "",
    "date": "March 21, 2023",
    "body": ""
  },
  {
    "header_value": "Carol Yeager",
    "photo": "",
    "date": "February 1, 2023",
    "body": ""
  },
  {
    "header_value": "Tom Awbrey",
    "photo": "",
    "date": "January 29, 2023",
    "body": ""
  },
  {
    "header_value": "Shelly Bliss",
    "photo": "",
    "date": "October 1, 2022",
    "body": ""
  },
  {
    "header_value": "John Rose",
    "photo": "",
    "date": "June 19, 2022",
    "body": ""
  },
  {
    "header_value": "Rose Roddy",
    "photo": "",
    "date": "May 4, 2022",
    "body": ""
  },
  {
    "header_value": "Capt Robert Coons",
    "photo": "",
    "date": "March 5, 2022",
    "body": ""
  },
  { "header_value": "Tony Utorka", "photo": "", "date": "2022", "body": "" },
  { "header_value": "Steve Holtz", "photo": "", "date": "2022", "body": "" },
  {
    "header_value": "Nancy Marchand (Weeran)",
    "photo": "",
    "date": "2022",
    "body": ""
  },
  {
    "header_value": "Dulcie (Molyneux) O’Malley",
    "photo": "",
    "date": "2022",
    "body": ""
  },
  {
    "header_value": "Sammy Pedro",
    "photo": "",
    "date": "August 30, 2021",
    "body": ""
  },
  {
    "header_value": "Rodolfo \"Rudy\" O. Olaires",
    "photo": "",
    "date": "July 10, 2021",
    "body": ""
  },
  {
    "header_value": "Phil McNany",
    "photo": "",
    "date": "May 18, 2021",
    "body": ""
  },
  {
    "header_value": "Capt. Leo Leonard",
    "photo": "",
    "date": "May 3, 2021",
    "body": ""
  },
  {
    "header_value": "Barbara Travis",
    "photo": "",
    "date": "April 7, 2021",
    "body": ""
  },
  {
    "header_value": "Captain Carlos Acuna",
    "photo": "",
    "date": "February 9, 2021",
    "body": ""
  },
  { "header_value": "Gaye Goodwin", "photo": "", "date": "2021", "body": "" },
  {
    "header_value": "Kathy Bannan",
    "photo": "",
    "date": "December 22, 2020",
    "body": ""
  },
  {
    "header_value": "Joanne Chino-Maloney",
    "photo": "",
    "date": "December 4, 2020",
    "body": ""
  },
  {
    "header_value": "Paul Rasmussen",
    "photo": "",
    "date": "November 20, 2020",
    "body": ""
  },
  {
    "header_value": "Bob Benson",
    "photo": "",
    "date": "September 15, 2020",
    "body": ""
  },
  {
    "header_value": "Chris Prescott",
    "photo": "",
    "date": "June 20, 2020",
    "body": ""
  },
  {
    "header_value": "Capt. David Wright",
    "photo": "",
    "date": "June 1, 2020",
    "body": ""
  },
  {
    "header_value": "Jerry Cavenaugh",
    "photo": "",
    "date": "May 8, 2019",
    "body": ""
  },
  { "header_value": "Katie Bitters", "photo": "", "date": "2019", "body": "" },
  {
    "header_value": "Capt. Joe Goodwin",
    "photo": "",
    "date": "December 26, 2016",
    "body": ""
  },
  {
    "header_value": "Captain Gerard “Rod” Donovan",
    "photo": "",
    "date": "October 23, 2018",
    "body": ""
  },
  {
    "header_value": "Dani Green",
    "photo": "",
    "date": "August 5, 2016",
    "body": ""
  },
  {
    "header_value": "Joe McCarthy",
    "photo": "",
    "date": "February 14, 2016",
    "body": ""
  },
  {
    "header_value": "Capt. Marion \"Randy\" Prine",
    "photo": "",
    "date": "November 19, 2015",
    "body": ""
  },
  {
    "header_value": "Zdenek Hradecky",
    "photo": "hradecky.jpg",
    "date": "February 1, 2013",
    "body": "Zdenek Jaroslav Hradecky, a 43 year resident of Redondo Beach, passed away on Friday, February 1st, 2013. Born in  Prague, Czech Republic, Zdenek was 63 when he died. Zdenek, or Zenny, had an independent soul and an adventurous spirit.  He immigrated solo from Prague to the United States at only 20 years old in 1969. As a younger man he was an avid soccer player, fisherman and loved cooking.  The first time he saw the Pacific Ocean in early 1970 he jumped in fully clothed; he knew he found his new home.  He loved soccer, fishing, cooking and classic rock music.  He remained in Redondo Beach where he married and raised his two children. His interest in travel manifested itself in a 33 year career  with PSA / USAirways. He will be missed as he travels on. Zdenek is survived by his sister, Marie Hradecka of Prague, CZ; daughter, Cassandra Hradecky of Redondo Beach, CA and son, Jonathan Hradecky of San Francisco, CA.  He was preceded in death by his wife of 25 years, Sandra and his parents,  Marie and Vladimir Hradecky of Prague, Czech Republic.  The Memorial  Service will be held at Rice Mortuary on Friday February 15, 2013 at 2:00 p.m. A reception follows in Rice's Lighthouse Reception Room until 5:00 pm. Burial will be private."
  },
  {
    "header_value": "Roy Micheli",
    "photo": "",
    "date": "October 11, 2012",
    "body": "Hired 7/25/1985 in SFO. Passed away in CLT."
  },
  {
    "header_value": "Ron Bird",
    "photo": "",
    "date": "September 17, 2012",
    "body": "Ron was born on September 27, 1944 in Montebello, CA to Jack and Donna Bird. He attended Serra High School, CA and Loyola University, CA. He was a commercial airlines pilot for 26 years. Ron met Cecily on Catalina Island where each of them were on vacation with their families. They married on December 31, 1966 in Long Beach, CA. Survivors included his wife Cecily of 45 years, daughter Stephanie Ann, son John D. and wife Anne."
  },
  {
    "header_value": "Norm Dargie",
    "photo": "",
    "date": "August 20, 2012",
    "body": "Norm came to PSA following stints with World Airways and TWA. After retirement, Norm consulted for numerous airlines before moving to Grass Valley in 2009."
  },
  {
    "header_value": "Nancie Russell Henegar",
    "photo": "",
    "date": "April 16, 2012",
    "body": ""
  },
  {
    "header_value": "Gene Timmons",
    "photo": "",
    "date": "March 15, 2012",
    "body": ""
  },
  {
    "header_value": "Jimmy (JR) Reynolds",
    "photo": "",
    "date": "March 1, 2012",
    "body": ""
  },
  {
    "header_value": "Capt. Jerry Blakely",
    "photo": "",
    "date": "February 19, 2012",
    "body": ""
  },
  {
    "header_value": "Capt. Robert \"Bill\" Sherman",
    "photo": "",
    "date": "2012",
    "body": ""
  },
  {
    "header_value": "David S. Nakashima",
    "photo": "",
    "date": "December 28, 2011",
    "body": ""
  },
  {
    "header_value": "Capt. Earl Tritt",
    "photo": "",
    "date": "August 14, 2011",
    "body": ""
  },
  {
    "header_value": "Capt. Jack Resley Beck",
    "photo": "",
    "date": "June 2, 2011",
    "body": ""
  },
  {
    "header_value": "Richard Grube",
    "photo": "",
    "date": "July 29, 2010",
    "body": "Richard Albert Grube, 63, of East Bend passed away unexpectedly on Thursday, July 29, 2010. Richard was born February 15, 1947 in Lewistown, MT, son of the late Albert and Silvia Grube. Richard was honorably discharged from the US Navy on December 27, 1970, after giving his service for 4 years. He also retired after 38 years from US Air (Pacific Southwest Airlines). He enjoyed NASCAR, bowling, and spending time with his family. Survivors include his loving wife of 40 years, Donna Riedel Grube of East Bend, NC; daughters, Marilyn Paauwe of San Diego, CA, Christina Grube Norman of East Bend, NC, and Laura Grube of Winston-Salem, NC; grandchildren, Richard and Dawn Paauwe of San Diego, CA, Zachary Grube of Winston-Salem, NC, Lillian Knabb of Winston-Salem, NC, Abigail Leonard of East Bend, NC; sister, Delores Brown and husband of Deer Island, OR."
  },
  {
    "header_value": "William H. \"Bill\" Davis",
    "photo": "",
    "date": "June 23, 2010",
    "body": "Bill was born in North Chicago, Illinois on August 1, 1932 to Herbert and Eunice Davis, who proceeded him in death. Bill is survived by his loving wife, Beverly of Congress AZ; daughters Lee Ann Paris, Sharon Ainsworth, and Pat Winship of San Diego; grandchildren Jamee Brotherton, Josh Millerd, Bridgette Coleman, and John-Henry Ainsworth; great grandson Asher Price; and Bill's brother, George Davis of Houston TX. Bill worked in San Diego for Pacific Southwest Airlines and then US Airways from which he retired in 1992."
  },
  {
    "header_value": "Judy Polahar",
    "photo": "",
    "date": "June 5, 2010",
    "body": "Judy Polahar passed away last night, June 5, 2010 due to breast cancer which was discovered only recently, and had already spread. Judy's family, and her friend Susie Vozely, were able to be with her at home during her passing since she had hospice care. JP was hired with PSA in September, 1981. She left SAN RES in the late 90's. She is survived by her children, Sherri, Christopher, and Shelly, plus grandchildren."
  },
  {
    "header_value": "Liz Dugan",
    "photo": "",
    "date": "April 26, 2010",
    "body": "I am sorry to say our friend, Liz Dugan, (PSA/USAirways SAN RES), passed away April 26, yesterday, in Margate, Fl.  She was in Hospice and had been in and out the hospital since October, 2009."
  },
  {
    "header_value": "Hugh N.\"Woody\" Wood",
    "photo": "",
    "date": "December 6, 2009",
    "body": "Hugh Wood, one of the founders of PSA, was born in Long Beach on June 28, 1923. A Naval aviator during World War II, Woody went through the Plosser-Friedkin school to obtain his civilian licenses, and joined Kenny Friedkin as an instructor after graduation. Woody became the sales department of PSA when the airline started, and remained as Vice President of Sales until 1967, when he left the airline. His work was instrumental to establishing the legitimacy of PSA when it first started, as well as creating many of the innovations PSA was known for, such as Instant Ticketing. After PSA, Hugh became Executive Director of the National Alliance of Businessmen in San Diego. Woody and his wife Darlene also owned and operated two large cattle ranches in Northeastern Utah.  Woody and Darlene moved to Murphys, CA in 1974. Woody is survived by his wife Darlene, three daughters, six grandchildren, and one great-granddaughter."
  },
  {
    "header_value": "Capt. Mike Bogle",
    "photo": "",
    "date": "March 6, 2009",
    "body": "<p>Capt. Mike Bogle, one of the most legendary PSA pilots, passed away peacefully March 6th.</p><p>During World War II, Mike was a test pilot in the Navy, flying the Corsair and PBY. Mike was hired by PSA in 1951, and grew to be known for his legendary sense of humor, and devotion to work and family.</p><p>In the early days, Mike worked at a radio and tv station, ferried airplanes, and sang in the Starlight Opera to help feed his family. Mike continued to perform with the Starlight Opera for many years.</p><p>Mike's sense of humor was legendary. On one flight, after landing, he jumped out of the cockpit quickly and ran around to the back stairs, telling the stewardess who opened the door that \"I've been chasing you all the way!\" He would carry an encyclopedia (the \"C\" volume) and explain in great detail over the PA how everyone knows how electricity was invented, but nobody knows who invented the toilet (Thomas Crapper). Passengers never seemed to know this one, except for one - Ronald Reagan.</p><p>Mike flew all types of aircraft in the PSA fleet, and served as Chief Pilot, prior to his retirement on April 1, 1982. After \"retirement\", Mike remained active flying for Scenic Air, as well as Gulf States Toyota and Cinema Air for many years.</p><p>Once you met Mike, he never forgot you, and you never forgot him. Pilots always remarked \"When I want to grow up, I want to be just like Mike.\"</p><p>Services will be held March 19th at Immaculate Conception Church, in Old Town at 11 AM."
  },
  {
    "header_value": "Howard Stanley Lane",
    "photo": "",
    "date": "January 1, 2009",
    "body": "Howard Stanley Lane was born April 11, 1919 in Julian , CA .  He passed away unexpectedly in La Mesa , CA. on January 1, 2009 at the age of 89.  He was the younger son of D. Frank and Stella E. (Shaw) Lane, Julian pioneers.  His family roots in Julian ran deep.  Over the years, Howard always loved bringing his family up to Julian, never missing an opportunity to point out the places where he had great carefree adventures as a young country boy.  He talked of horseback rides all over the hills, adventures with his miner father (Blue Hill Mine), collecting honey from his Dad‚Äôs aviary down by Butterfield, and his Mom‚Äôs many jobs in Julian as town switchboard operator, school teacher, and caretaker of the Julian Hotel .  The town of Julian honored his father by naming a park after him, the Frank Lane Park. </p><p>Howard graduated from Julian High School and attended San Diego State University .  It was in Julian that he met the love of his life - Betty Jane (Howe) ‚Äì from Warner Hot Springs.  Her family had come to Warners from San Diego to run the post office, grocery store and work at the resort restaurant.  Howard and Betty married in 1941 and had a blessed 66 years together, raising their three children in Lemon Grove , CA . </p><p>\"Howie‚\", or \"Ace Mechanic.\" as he was lovingly called by all who knew this kind, gentle man, started his lifelong career and passion for aviation by working at Lindberg Field for Airtech Flying Service. He became a licensed private pilot and had lots of stories to tell about these adventures.  After a brief stint at Convair, he was drafted into the Army.  During World War II he served in the Army Air Force as an inspector of B-24s which were flying into China from India .  After the war, he went back to work at Nelson-Kelley Co. as an aircraft mechanic on private and commercial airplanes.  This company eventually was sold to Friedkin Aeronautics ‚Äì which later became Pacific Southwest Airlines. Except for a brief return to Convair in the early 60s, he worked in the engine overhaul shop as an inspector at PSA (US Air) until his retirement in 1984. </p><p>Howard and Betty loved to travel ‚Äì both by air and taking camping road trips around the country.  Throughout his retirement years, Howie continued a close relationship with many of his fellow PSA colleagues ‚Äì sharing a desert camping spot, traveling internationally and by attending the annual PSA Oldtimer‚Äôs Picnic. </p><p>Howard was a devoted husband, loving father and grandfather who always put his concern for his family first. He was preceded in death by his beloved wife, Betty Jane, one year ago. He is survived by his daughters, Sharon (John) Woodrow of Alpine, Sheryll (Al) Foye of Alpine; son, Steven (Arlean) Lane of El Cajon; five grandchildren and eight great-grandchildren. </p>"
  },
  {
    "header_value": "Richard \"Dick\" Hooper",
    "photo": "",
    "date": "September 13, 2008",
    "body": "<p>Passed September 13, 2008</p><p>Richard (Dick) Hooper passed away peacefully Saturday, September 13, 2008 surrounded by his family. Dick is survived by his two daughters, Dawn and Kim; son, Jason; five grandchildren; and one great grandchild.</p><p>Dick enjoyed a long career in the airline industry and retired in 2000. He volunteered more than 3000 hours with the City of San Diego, Police Department's RSVP program. Dick was also a patient advocate and recipient of stem cell research.</p><p>In lieu of flowers, contributions can be made in Dick's name and sent to: California Institute for Regenerative Medicine, 210 King Street, San Francisco, CA 94107. </p>"
  },
  {
    "header_value": "Margaret \"Peggy\" Miyose",
    "photo": "",
    "date": "June 27, 2008",
    "body": "<p>Margaret (Peggy) Miyose passed on June 27, 2008 peacefully in California with family present. She is survived by her daughter, Pam Shaw of Spring Lake, NC, and her niece Nancy Glaze of Kileen, Texas and family and friends who loved her.</p><p>Peggy started with PSA at the Reno Reservations Center in 1986.  After the merger with USAir, Peggy transfered to IND for a few years and then to INT, where she retired and enjoyed her travel benefits.</p>"
  },
  {
    "header_value": "Nancy Brew-Schaffer",
    "photo": "",
    "date": "June 3, 2008",
    "body": "<p>Nancy, our mother, daughter, grandmother, great grandmother, longtime colleague, friend and special spirit, passed away June 3, 2008 to be with her Lord and Guardian. At the time of her death she was living in Meridian, Idaho.  Nancy struggled against a nine month battle with lung cancer.  Nancy will be loved, shared and remembered by everyone she met in her life.</p><p>Nancy was born on December 4, 1946.  She was raised as an only child by loving and caring parents, Florence and Frank Taylor in San Diego. Nancy was the proud and loving mother of daughter Alana, to be followed by her treasured twins Kevin and Alicia.  In 1971, Nancy was to find a long and productive career with PSA and then USAirways.   During her 30 years with the airlines, Nancy developed long and lasting friendships with many of her fellow colleagues.</p><p>Nancy will be greatly missed and forever remembered by those who shared her</p><p>unforgettable laugh, the quick wit, her dedication, kindness and loyalty.</p><p>Nancy is survived by her husband, Bill Schaeffer, her daughter Alana Webber, her twin children Alicia Brew Beach  and Kevin Brew, grandchildren Jamie, Kelly, Jack,</p><p>Annie, Ellie and great grandson, Dayton.</p>"
  },
  {
    "header_value": "Gary Kissel",
    "photo": "",
    "date": "May 24, 2008",
    "body": "<p>Gary Kissel, former director of Public Relations, passed away Saturday evening in Banning, CA, with his family by his side. In accordance with his wishes, there will be no funeral service.</p><p>Gary was born in Nebraska in 1932, and raised in Kansas. After studies at the Universities of Kansas and Nevada, he served in the U.S. Air Force at Nellis AFB. Gary moved to Southern California in 1964, working at several Southland newspapers before joining the City of Los Angeles Airports department in Public Relations. Gary was hired by PSA as Director of Public Relations in 1968, and became Director of Corporate Communications in 1974, before leaving PSA in 1979.</p><p>In his retirement, Gary volunteered for the San Diego Aerospace Museum, and wrote the book \"Poor Sailors Airline\" in 2002.</p>"
  },
  {
    "header_value": "Carol Dye",
    "photo": "",
    "date": "April 19, 2008",
    "body": ""
  },
  {
    "header_value": "David Herbert",
    "photo": "",
    "date": "September 19, 2007",
    "body": "<p>David was born Sept. 23, 1942 in Cincinnati, OH, and grew up in Los Gatos, CA, where he attended Union Elem. and Camden High. He graduated from Whitman College in Walla Walla, WA, then received flight training at Santa Cruz Airport and enlisted in the California National Guard. </p><p>David joined the PSA family in 1966, and retired from US Airways in 1999. Outside of PSA, he loved to travel, play golf, tennis, waterski and snow ski, and restore his 1964 Corvette Stingray. </p><p>After a long battle with brain cancer, David passed on peacefully at home. He is survived by his wife Annie, daughter Kimberly, son-in-law Dean Hopkins, granddaughters Taylor and Hope, as well as his brother Mark and sister Laura.</P>"
  },
  {
    "header_value": "Kathy Cunningham",
    "photo": "",
    "date": "September 4, 2007",
    "body": "<p>Kathy was born January 20, 1959, and began her career with PSA in Fresno on October 23, 1979. Kathy spent 28 years with PSA and US Airways, rising up to become a Customer Service Supervisor in SFO. She was part of the merger integration team between America West and US Airways in SFO, as well as station trainer and Star Alliance resource.</p><p>Kathy had a strong will for life, beating cancer twice during her twenties and receiving a heart transplant at age 40. After her recovery, she lived an incredible life. Kathy never looked back, did everything with passion and gave of herself to others completely. Kathy is survived by her husband Paul, parents Carl and Virginia Sodergren, brothers Mike and Chris, and Golden Retrievers Otis and Romeo.</p>"
  },
  {
    "header_value": "DeArmond \"Andy\" Anderson",
    "photo": "",
    "date": "August 5, 2007",
    "body": "<p>Andy Anderson was born July 3, 1919, and raised in Phelps County Nebraska with an early avocation for aviation. After working for Ryan Aircraft before World War II, he joined the Army Air Corps as a primary training instructor/mechanic in Tucson, before returning to San Diego to work for Bill Gibbs at Montgomery Field.</p><p>Andy joined the PSA family in 1952 as a mechanic, and rose to Assistant Vice President of Maintenance in 1973, retiring in 1982.</p><p>Andy enjoyed traveling throughout the USA and Western Europe as well as Mexico and the California backcountry with his wife of 65 years, Lucille.  He was a man of sincerity and integrity and will be deeply missed. </p><p>Survivors include his son Gary Anderson of San Diego, two grandchildren, Alan and Rita Anderson of the San Francisco Bay area, and many cousins, nieces and nephews in the Mid-west. He was preceded in death by his wife, Lucille O. Anderson.</p><p>Internment was held at Greenwood Memorial Park in San Diego.</p>"
  },
  {
    "header_value": "Jere Nudson",
    "photo": "",
    "date": "March 1, 2007",
    "body": "Jere passed in March 2007. He and Pat have been staying close to their daughter's family in an assisted living facility in Mesa, Arizona, and in these past couple of years Jere suffered from Alzheimer's disease, ultimately leading to his death.  He slipped away from us peacefully."
  },
  {
    "header_value": "Edward Kucynski",
    "photo": "",
    "date": "January 29, 2007",
    "body": "<p>Edward Henry Kucynski, 80, of San Diego died Jan. 29. He was born on August 15, 1926 in McDonald, Ohio, and joined PSA as a mechanic after retiring from the Navy, completing his career with USAir.</p><p>Survivors include his wife, Willodean Buster-Kucynski; daughters, Patty Carr of San Diego, Martha Jarrett of Corpus Christi, Texas, and Betty Dugger of El Cajon; brother, Stanley Kucynski of Ohio; 12 grandchildren; 22 great-grandchildren; and eight great-great-grandchildren. </p>"
  },
  {
    "header_value": "Carl Eugene \"Gene\" Long",
    "photo": "",
    "date": "January 18, 2007",
    "body": "Carl passed away in his home in San Marcos, CA from complications from Leukemia. Gene was born August 3, 1938 in Ross County, Ohio, and married his loving wife, Elizabeth Ann 'Mickey' Blazer on September 7, 1956. Carl was a veteran of the U.S. Marine Corps, and retired from the Building Maintenance Department of PSA and US Airways. He loved his family and friends, restoring old cars, mushroom hunting, riding his Gold Wing, traveling in his new motorhome and spending his summers at his second home in New Haven, IN. His friendly smile and great sense of humor will be missed by all who knew him. A memorial service will be held at a later time in New Haven, IN and in his hometown of Frankfort, Ohio.   "
  },
  {
    "header_value": "Gene Milligan",
    "photo": "",
    "date": "January 15, 2007",
    "body": ""
  },
  {
    "header_value": "Pat Ferguson",
    "photo": "",
    "date": "January 12, 2007",
    "body": "Pat Ferguson passed away near her family in Reno, NV on January 12 from heart complications. Pat joined PSA in 1978 in SAN RES, transferring to Reno in 1986, where she stayed until 1990. Pat was a brest cancer survivor, and a talented seamstress in addition to her work at PSA and USAir."
  },
  {
    "header_value": "David Hinesly",
    "photo": "",
    "date": "October 22, 2006",
    "body": "David passed on October 22, 2006 from ALS."
  },
  {
    "header_value": "Peter Jackalus",
    "photo": "",
    "date": "September 16, 2006",
    "body": ""
  },
  {
    "header_value": "Capt. Larry Selleck",
    "photo": "",
    "date": "August 26, 2005",
    "body": ""
  },
  {
    "header_value": "Moises &quot;Cas&quot; Castillo",
    "photo": "",
    "date": "August 1, 2005",
    "body": ""
  },
  {
    "header_value": "Robert &quot;Bob&quot; Flores",
    "photo": "",
    "date": "June 9, 2005",
    "body": " A&P Mechanic in SFO/OAK for nearly 30 years with PSA and US Airways."
  },
  {
    "header_value": "Nikki St. Germain",
    "photo": "",
    "date": "May 8, 2005",
    "body": "<p>Nikki St. Germain was one of the guiding lights in the PSA family. Nikki was born in San Diego in 1949, and joined PSA in 1968 after graduating from Crawford High School.</p><p>Nikki showed her talents rapidly, moving up from a stewardess into stewardess training, then to manager of Flight Attendant training and director of in-flight customer service.</p><p>In 1984, Nikki was named manager of customer service in LAX, with further promotions to regional director of customer service and director of reservations by 1987. Sadly, Nikki lost her husband, Doug Arthur, in the tragedy of flight 1771 - after losing her brother, Donald, on flight 182.</p><p>Nikki left PSA in 1987 and devoted her life to fundraising. Working with the La Playa unit of Children's Hospital Auxiliary and Voices for Children, she devoted her energies to both these organizations with the same dedication that served her well at PSA.</p><p>Services were held May 12, 2005 in San Diego.</p>"
  },
  {
    "header_value": "Dave Burness",
    "photo": "",
    "date": "April 8, 2005",
    "body": "Dave was born in Oakland and as a young man served in the United States Navy. From 1950 to 1975 he resided in San Diego with his family where he was employed by Pacific Southwest Airlines, working his way up from mechanic to Vice President of Engineering. In 1975 he went with the Boeing company to Baghdad, Iraq. In 1977 he was hired as Vice President of Engineering by Royal Jordanian Airlines in Amman, Jordan. In 1984 he retired to the island of Cyprus where he enjoyed boating and scuba diving. In 1992 he returned to California moving to Santa Maria. Dave was fortunate to have traveled to many countries around the world with his wife Iona, where they made many friends along the way. Dave was well respected and will be deeply missed and never forgotten."
  },
  {
    "header_value": "Capt. Donald \"Gene\" Lundy",
    "photo": "",
    "date": "March 18, 2005",
    "body": "Capt. Donald \"Gene\" Lundy, 69, of El Cajon passed away March 18. He was born Dec. 29, 1935 in Conway, SC. Gene is survived by his wife Billie, son Don, daughter-in-law Sandy, two beautiful grandchildren Lisa and Jenny, sister Elizabeth Watson, father-in-law C.K. Hill, sister-in-law Sandi Krizan and many other treasured family and friends. Gene was a retired PSA/USAirways Captain. Not one to sit down and let the world go by during his retirement, he started and owned several businesses.  He was a member of many associations but the one that he was most passionate about was VFW/VMA 2275.  Inurnment and a memorial service will be Friday, April 1 at Fort Rosecrans National Cemetery at 10am.  An additional memorial service will also be held Saturday April 2 at 11am at the VFW/VMA, 136 Chambers St, El Cajon.  In lieu of flowers, donations may be made to the VFW/VMA #2275."
  },
  {
    "header_value": "Harry Somers",
    "photo": "",
    "date": "February 27, 2005",
    "body": "Harry Vincent Somers Jr. retired from the Navy and joined Pacific Southwest Airlines. (More information in progress)."
  },
  {
    "header_value": "H.E. \"Ham\" Fears",
    "photo": "",
    "date": "February 13, 2005",
    "body": "<p>Ham was a native San Diegan born July 27, 1917. He was predeceased by his wife Betty, in 1983. He left 6 children, 11 grandchildren and numerous (meaning too many to keep track of) great grandchildren.</p><p>He joined the PSA family in February, 1951, relocating with his family to Oakland to take charge of maintenance. When Oakland was phased out, he moved to San Bruno and headed the maintenance department for San Francisco until 1959.</p><p>Ham returned to San Diego and filled many positions, including mechanic and foreman until his retirement in 1975. Among his responsibilities were the design, fabrication and purchase of all tooling and equipment for Boeing 727 and Boeing 737 aircraft. He spent many months in Seattle learning these aircraft from the inside out.</p><p>During the introduction of the Lockheed L-1011 aircraft into passenger service he served as tooling and equipment coordinator. Here again he went to ‚Äúschool‚Äù at Lockheed to learn it all.</p><p>After his retirement, Ham volunteered at the San Diego Aerospace Museum, where he worked on the replica of the Spirit of St Louis, and other projects.</p><p>Ham enjoyed getting together with some of the other \"Old-timers\" and sharing memories of the good old days. He will be missed by many friends and family.</p>"
  },
  {
    "header_value": "Fred Villanueva",
    "photo": "",
    "date": "December 1, 2004",
    "body": "Fred passed away in December 2004, while flying for Salmon Air of Idaho. Fred was an A&P mechanic in the 1960s, before being drafted and sent to Vietnam."
  },
  {
    "header_value": "Capt. Bill Hall",
    "photo": "",
    "date": "November 30, 2004",
    "body": "<p>Bill joined PSA in 1965 as a pilot on the Lockheed Electra. Prior to PSA, Bill was a gunnery sargent in the Marine Corps, as well as an aircraft salesman and instructor at Air Oasis. in 1961-62, Bill flew san Diego Union publisher James Copley's DC-3.</p><p>Bill moved through the ranks at PSA to join the training department, becoming a popular trainer. Forrest Allen noted \"Bill could take guys who were having trouble and work hard to get them through...He had rapport with people, good humor, and he had some techniques that worked.\" Bill served for six months as manager of the flight training department, as well as serving as a check pilot.</p><p>After the merger, Bill moved the Charlotte training base, ending his career on the Boeing 767 in 1994. After retirement, Bill indulged his love of hunting and fishing from homes in Lake Havasu and Prescott.</p><p>We will miss you, Bill.</p>"
  },
  {
    "header_value": "Capt. Larry Wechsler",
    "photo": "",
    "date": "October 16, 2004",
    "body": "<p>On October 16, 2004 Captain Larry Wechsler, age 55, died unexpectedly while jogging near his home in Tucson, AZ. </p><p>Larry was hired by PSA in 1976. At the time of his death, he was a USAirways Boeing 767 International Captain based in PIT. He was one of the best, not only as a pilot, but as a a loving husband and father, and friend and fellow aviator. He is survived by his wife Mary, and their two daughters Kathy and Jennifer.</p><p>Captain Wechsler was also employed by Flight Safety International as an instructor that specialized in Automated Flight Deck Training and was noted for his contributions as an expert in that field.</p>"
  },
  {
    "header_value": "Jack Stoops",
    "photo": "",
    "date": "July 7, 2004",
    "body": "Jack was born in Boyleston, Indiana and moved to San Diego at the age of 18 when he joined the Marine Corp. After the Marines, he began a career in the travel industry that spanned 60 years, including American Airlines, PSA, Hughes Airwest, Northwest Airlines, Tauck Tours, Via Rail and JAL. He is survived by his wife of 61 years, Anna Jean, and his daughter and son-in-law, Jan and Steve Magnolia of Lebanon, Oregon."
  },
  {
    "header_value": "Richard \"Dick\" Tatelman",
    "photo": "",
    "date": "June 15, 2004",
    "body": "Born in Colon Hospital, Panama Canal Zone on December 30, 1935. Dick was a member of the 1953 class of Cristobal High School. He was also educated at the US Merchant Marine Academy, Kings Point, NY and the University of Colorado Boulder, Colo. After sailing in the Merchant Marine and serving in the US Navy, he enjoyed a 30 year career with Pacific Southwest Airlines (PSA) and USAirways. After retiring in 1990 he toured Europe annually, in addition to various cruises, including ``RMS Queen Elizabeth 2'' world cruise segments. Periodically riding his vintage BMW motorcycle until his death he was also a Charter Member of the Heritage Society of the San Diego Maritime Museum and the San Diego Art Museum. He also served on the Church Council of the First Unitarian Universalist Church of San Diego as well as being elected for two terms as President of the Friars Village Assoc. Dick helped found the ``Live and Let Live'' Alano Club of San Diego. Preceded in death by his parents, Judge and Mrs. Edward Tatelman; sister Muriel O'Rorke and former wife and friend Maxine Myers; survived by nephews Regan O'Rorke of Key Biscayne, Fla., Robin O'Rorke of Scottsdale, Ariz., niece Susan Sebba of Tempe, Ariz., stepson Chris Stokes of La Jolla, Ca. His Grandfather, Harry Brown was a Roosevelt Medal of Honor holder."
  },
  {
    "header_value": "Dave Weir",
    "photo": "",
    "date": "May 21, 2004",
    "body": ""
  },
  {
    "header_value": "Reynold D. \"Duke\" Shangraw",
    "photo": "",
    "date": "April 1, 2004",
    "body": "Reynold \"Duke\" Shangraw was born in Franklin, MA on February 26, 1924. He is survived by his wife Anne, daughter Christine and grandson Kolter Bass."
  },
  {
    "header_value": "Gloria Sappington",
    "photo": "",
    "date": "February 24, 2004",
    "body": "<p>Gloria Panzer Sappington was born August 19, 1927 in Crookston, MN. After spending her youth in Grand Forks, ND, she decided to go to Alaska but never made it, meeting Reid Sappington in Bremerton, WA. In 1954, the young couple moved to Mission Beach, where Gloria worked for Food Basket before becoming a dance instructor, eventually starting her own dance studio.</p><p>Once Gloria closed the studio, she joined the PSA family as the space control agent, staying with PSA until 1984. Upon retirement, she stayed active with the PSA Oldtimers until her death, while travelling extensively through Europe. She is survived by Reid and her son Rick, as well as her mother Barbara Hancock, and brother Emil Panzer. Services were held March 16, 2004 at Fort Rosecrans.</p>"
  },
  {
    "header_value": "Richard Jedlund",
    "photo": "",
    "date": "December 16, 2003",
    "body": "<p>Richard Douglas Jedlund was born July 21, 1920 in Pelican Lake Township, MN. Joining the Navy, he served in World War II and entered the aviation industry in 1952 as a mechanic. Richard loved airplanes, and owned (and flew) an airplane along with his brother.</p><p>Retiring in 1982, Richard and wife Gail eventually moved to Prescott. Richard also enjoyed sailing and woodworking. He will be missed.</p>"
  },
  {
    "header_value": "Thomas Irwin",
    "photo": "",
    "date": "September 1, 2002",
    "body": "Tom Irwin, our friend, passed away September 1. Originally from Jarrow-On-Tyme, England, Tom emigrated with his wife, Joy, to San Diego in 1960 and joined PSA in the print shop. Tom got actively involved with PSA and the community, coaching Little League, as President of the Credit Union, and with the PSA Oldtimers. A self-taught computer programmer, Tom wrote several programs to move PSA into the computer age and maintained the records of the Oldtimers organzation, as well as the official web site, until his death. He is survived by his wife, Joy; daughter, Laurie; son, Stuart; daughter-in-law, Terri; 3 grandchildren, Taylor, Lindsay, and Dylan; father, George; brother, Jim; and sister, Doris. Services were held September 14 at Tourmaline Beach, with representation from the PSA family."
  },
  {
    "header_value": "Capt. Don J. Dolan",
    "photo": "",
    "date": "April 6, 2002",
    "body": "<p>Born in 1918 Highland Wisconsin, Don lost his parents at an early age then was raised by an aunt and an uncle on a dairy farm in New Underwood S.D.   Getting up early, working hard and then going to school under difficult conditions.</p><p>Don joined the navy in 1942 with vision of becoming a WW11 fighter pilot but the closest he got to his dream was as a Motor Machinist's Mate on an Escort Carrier.  It was not until after the war that he took flying lessons while working for an Orange County auto dealer that he fulfilled his dream. Eventually becoming an Air Force Instructor.      Following this, he joined PSA, where he had an illustreous 20 year flying career beginning in 1958 and culminating as our Chief Pilot and instructor.</p><p>Outside of PSA, he persued his love of baseball by being a little league coach managing a La Mesa/El Cajon team which in 1961 became the most successful team in San Diego history, winning the Little League World Series in Williamsport Pennsylvania.</p><p>Don was respected and loved by all who knew him.   A truly good man and a great American.     He is survived by his wife Ruby, his children, daughters Lynn, Sharon, a son Jim, 6 grandchildren and 5 great grandchildren.   We miss his presence each month when we would gather together.    Fly well with God Don....</p>"
  },
  {
    "header_value": "Fred Hunter",
    "photo": "",
    "date": "April 1, 2002",
    "body": "San Diego Scheduler."
  },
  {
    "header_value": "Eleanor \"Fergie\" Glithero Fulmer",
    "photo": "",
    "date": "September 24, 2001",
    "body": "<p>Eleanor \"Fergie\" Glithero Fulmer, 79, passed away leaving behind a loving family, thousands of former friends and co-workers and an unparalleled legacy in the airline business.</p><p>Born Eleanor Grace Ferguson, the daughter of the deputy superintendant of schools in Glendale, CA , she graduated from the University of California Los Angeles with a degree in Education.  As treasurer and later president of Delta Gamma Sorority at UCLA, she was given the nickname of \"Fergie\" that lasted her entire lifetime.  Following graduation, she volunteered as an officer in the U.S. Navy WAVES (Women accepted for Voluntary Emergency Service) and was certified as a Link Trainer at Hunter College. She was ultimately assigned to instruct pilots at the North Island Navy Base in San Diego (Coronado).</p><p>In 1946, she resigned her commision to take a Link Trainer job with Friedkin Aeronautics, a small civilian aviation school doing business at Lindbergh Field in San Diego. Swifly promoted to office manager, she accepted more and more responsibility at the school and became a close advisor to Kenny and Jean Friedkin who founded Pacific Southwest Airlines (PSA) in 1949.   She was a trusted member of every management team that controlled PSA over the next 36 years. </p><p>At a time when few women held corporate positions in the airline industry, Friedkin appointed Fergie Secretary of Giles, Inc., Friedkin's personal corporation in 1953; Secretary-Treasurer to Friedkin Aeronautics, Inc., board of directors (then parent company to the fledgling airline) in 1954. In 1963, as the top financial officer for PSA, she worked with airline officers, privated attorney's and the Securities Exchange Commission to move PSA from a private to a public corporation. She developed the company's first credit card, computerized the accounting department and created a unique ticketing system that was, for many years, the fastest in the industry.</p><p>As the California airline grew in popularity and in size, hundreds of people were added to the payroll.... and ALL knew her as \"Fergie\". She made it a point to become as aquainted with as many PSA employees as possible.  Her quick wit, charming personality and obvious concern for their concerns made them all her friends.</p><p>A gourmet cook, she played a good game of golf, then retired from PSA in 1982 to spend more time with here family and to travel.    She was active in the PSA Oldtimers organization, the Altrusa women's service club and was honored by the YWCA in 1981 in their tribute to Women in Industry program.</p><p>Survivors include her husband, Richard Fulmer; daughters, Dianne Kuerbis of San Diego, and Sandra Flynn, of Rancho Bernardo; 4 grandchildren and 4 great- grandchildren.</p><p>At her request, there were no services.</p>"
  },
  {
    "header_value": "Robert Treadwell Stone",
    "photo": "",
    "date": "March 28, 2001",
    "body": "<p>Robert was born in Oakland, CA. on 2/26/1954.   Robert graduated from UC Davis with a degree in accounting.  He thoroughly enjoyed his position with PSA as well as his transfer to Pittsburgh with USAir, as a buyer in Aircraft and Technical Procurement.  He eventually returned to San Diego due to numerous health problems and desire to be closer to family and long-time friends.</p><p>Even though Robert was handicapped for several years, he always maintained a wonderful positive attitude.   Loving to travel and enjoy helping others.   His generous nature inspired all who knew him.</p><p>He also developed a special love for his service trained dog Kadie and his van as it afforded him the opportunity to take her along camping, another love of Robert's.  He was an avid bridge player and won many awards for his skill.   He also enjoyed singing and was a member of several chorus groups, as well as an alumni member of the San Francisco Boys Chorus.</p><p>Robert had also taken courses toward obtaining an additional degree in elementary education and was a substitute teacher in Palm Springs Ca. at the time of his death.  He enjoyed working with children and was a wonderful tutor and a friend to all. </p><p>He tremendously enjoyed attending the annual PSA picnics.   The opportunity to see old friends meant so much to him.</p><p>He is and forever be dearly missed by family in San Diego and the San Franscisco bay, as well as his many friends.   We are sure he is smiling down to all of us, especially Kadie, who is dearly loved and cared for by family.</p>"
  },
  {
    "header_value": "Cleveland (Cleve) Jackson",
    "photo": "",
    "date": "February 22, 2001",
    "body": "<p>Following a long fight with diabetes and other health problems, our good friend Cleve passed away, at Kaiser Hospital in San Diego.  His funeral on March 22nd was attended by representatives of nearly every department of PSA and a large gathering of friends and family.</p><p>He was born Cleveland Jackson on March 19th, 1934, in Jacksonville, TX.   When he was just a toddler, Cleve's mother and father moved him, his three brothers and a sister to San Diego.  He grew up on Dells Drive, attended Stockton Elementary, Memorial Junior High, and went on to San Diego High School where he was active in sports. Some of the track records he posted high school and the San Diego Boy's Club still stand.  An extremely talented golfer, Cleve won many community and company tournaments. He graduated high school in 1952 and attended San Diego City College while working full-time at Convair and a part time at a fledgling airline known as PSA.</p><p>Cleve was a major part ot the airline family for 32 dedicated years.  Known to nearly every officer and employee of the company, Cleve was a genius at fulfilling his job as Director of Interior and Aircraft Appearance while taking on many other tasks. Because he could'nt say no to his friends, Cleve always found time to accomplish jobs completely out of his job description.</p><p>He leaves his wife Gerrie Lanatte jackson (also a long time and popular employee of PSA), a son, a sister, brother, three grand-daughters and a host of nieces, nephews, cousins and friends.  Fly with the Angels Cleve we knew you and loved you.</P>"
  },
  {
    "header_value": "Capt. Allan Lindemann",
    "photo": "",
    "date": "January 19, 2001",
    "body": "<p>Allan \"Lindy\" Lindemann was born in Ellwood Illinois on January 19th 1922.  Then at 7,moved to various places until his graduation in Albion Michigan in 1940.</p><p>He then joined the Navy in December 1941, serving in such hot spots as Guadacanal, Tunisia, taking great losses at Murmansk Russia and finally the invasion of France on 'D'day. Then was discharged from the Navy in San Diego in 1947.</p><p>In 1947 he worked in San Diego at Friedkin School of Aeronautics, eventually becoming a school student learning to fly, recieving various licenses from private thru ATR and Instrument.</p><p>He then became the 7th pilot hired by Chief Pilot \"Bud\" Plosser in June 1950. Doing double duty as Flight Instructor and line flying the DC3.</p><p>In 1953, he left the now PSA to become a Flight Instructor for the USAF. \"Lindy\" then returned to PSA in 1957, resuming his career as an airline pilot serving PSA as the consumate professional until his retirement in 1982.</p><p>\"Lindy\" always had a smile for everyone along with an infectious humor that touched us all. We were very lucky to have known him and what he left in our hearts.</p>"
  },
  {
    "header_value": "Robert (Bob) Chesebro",
    "photo": "",
    "date": "September 23, 2000",
    "body": "<p>Bob was born in Pittsburgh and known to the family he created as Daddy-O.   He moved to San Diego when he was 16 to his uncle Byron Shimmin's family.  Where he attended La Jolla High School.</p><p>He served in the US Navy on the Enterprise as an Aviation Structural Mechanic (first class) during WW II where he received many medals for being involved with such major battles as the historic Midway etc. </p><p>As a long time resident of Clairemont, he was known as \"Mr. Balboa Litttle League\" during the 60's.</p><p>He served PSA with distinction for 25 years until his retirement in 1987.   He is survived by many, Oh so many!, friends and relatives.   The most giving and unselfish man that his family knew.</p><p>It is with real care that this Obituary,written by his family is faithfully typed by his old friend \"Rackets\"</p>"
  },
  {
    "header_value": "Capt. Arthur F. Steck",
    "photo": "",
    "date": "September 3, 2000",
    "body": "<p>Born in San Diego, attended school in Los Angeles. Graduated from Los Angeles High and attended Santa Monica Junior College.</p><p>Worked for Consairways in Army Reserve from 1942 until 1945. Enlisted in US Navy 1945 and discharged in 1946. Returned to San Diego and worked as Aircraft Mechanic at Convair while attending the Friedkin School of Aeronautics. He obtained his flight Certificate and became a commercial test pilot for Convair. </p><p>In 1963 joined, the fledgling PSA as a first officer and was promoted to Captain in 1964. He flew for PSA until 1979, when he was transferred as a flight instructor at the re-knowned PSA Flight Training Center in Scripps Ranch.</p><p>He retired from PSA in 1983. Worked as a volunteer at the Rancho San Diego (Cottonwood) golf course and later as a docent at the San Diego Aerospace Museum until his passing. He was especially proud of establishing, after two years of hard work, the PSA exhibit that is now permanently on show there. We ALL owe him a lot in what he accomplished on our behalf and will miss him.</p><p>He is survived by his loving wife Elsie, a son, a daughter in law and six grandchildren.</p>"
  },
  {
    "header_value": "Capt. Chuck McClain",
    "photo": "",
    "date": "May 8, 2000",
    "body": "<p>As a teenager in school, Chuck earned money as a service station attendant to pay for flying lessons. He then joined the Navy to fly, but circumstance intervened. However, in the process became a remarkable A/C mechanic. He then resumed his civilian career as a flight instructor, at which time (in 1954), he married his life long Maxine which bore him four beautifully grown up children. All the while continuing on his flight ratings to the point where he was hired by Slick Airways in 1955. Flying both nationally and internationally.</p><p>It was in 1957 that Chuck was interviewed by, and immediately hired by PSA. A new approach airline looking for such dedicated flying talent. He served PSA with distinction for almost 28 years until ill health took it's toll and retired in 1983.  Not being able to stay away from being an Aviators aviator, he found his way into volunteer efforts at the San Diego Aerospace Museum. Contributing greatly in restoring and refurbishing the glorious past of his chosen career.</p><p>It is of such men that we at PSA owe a debt of gratitude for their dedication and professionalism.</p><p>He left behind an example of what to be in life, as a friend, a professional and the epitomy of how to be a family man. Our best wishes to his wife Maxine and how to be a family man and to the family he loved.</p>"
  },
  {
    "header_value": "Bill Treese",
    "photo": "",
    "date": "March 20, 2000",
    "body": "<p>We are sad to report that Bill Treese passed away in his sleep on March 20th at his home in Clovis California near Fresno.</p><p>As you remember, Bill started in SFO and worked his way up the ladder, paying his dues along the way.</p><p>He was the first Station Manager for the Fresno station in 1972.    He was later promoted to be the Station Manager in San Jose.</p><p>While on vacation, he was bitten by a bug that carried and infected Bill with virile espholitius (In olden days, this was called the Black Death).     Modern medicine kept him alive but in constant pain, for the rest of his life.</p><p>Bill is survived by his wife Ann. He also has a brother and sister both from out of state. As a USA veteran, Bill was interned with honors at a military site near Los Banos, California.</p><p>As Fred Hall (who knew him well), stated, Bill always had a kind heart and loved his work and fellow employees at PSA. We will all miss him.</p>"
  },
  {
    "header_value": "Capt. Tom J. McDonough",
    "photo": "",
    "date": "September 28, 1999",
    "body": "Tom was born in Minneapolis, Minnesota and moved to California in 1946. He attended schools in Los Angeles and after graduation from college, served in the Unites States Marine Corps. Tom then fullfilled a life long dream of becoming an airline pilot. This began with Continental Airlines and then with PSA until the buyout by US Airways and finally retired after 29 years as a senior Boeing 767 Captain. Tom is survived by his wife Linda, a sister Maureen Coleman, her children and an aunt Mary Diskin. The joy of being his friend along with the generosity of his spirit will forvever inspire all of us who knew him."
  },
  {
    "header_value": "Dr. Ivy Beaubouef",
    "photo": "",
    "date": "July 12, 1999",
    "body": "<p>\"A born teacher\" was the way Shirley his wife described him. An Ex-marine (Korean war). Earned a masters degree and began his lifes work in in education in 1957. Then further to this, earned a doctorate in Psychology. Became a school principle. In all of this, managed to volunteer for alchoholics anonymous as a sponsor to many. This also included substance abuse programs for teens.</p><p>A man who stood front and center in life. His need for change led him into the private sector. Luckily, brought him to us at PSA where he spent many years.</p><p>Ivy served as Mangagement Training Instructor and administrative assistant for the Flight and and Flight Attendant departments. His gentle humorous, perceptive manner and talent earned him the respect and love of us all.</p>"
  },
  {
    "header_value": "Judy Clayton/Kitten",
    "photo": "",
    "date": "June 22, 1999",
    "body": "<p>Judy, who earned an engineering degree became the first woman hired into our engineering dept. at PSA. She came aboard in 1966, served with distinction for 13 years before leaving in 1979 for other pursuits.</p><p>These included an award winning equestrian drill team (Rose Parade), horse breeding, magazine articles, poems and books. Her most poignant poem, \"The Lady and her Lamp\" is now in the library of Congress. Books included \"Tin Gods\" and another now in pre-publication called \"Hard Rain on the Sawtooth\".</p><p>Quick of wit, with a humor that ecompassed the world, a loving mother, grandmother (Known as Granby). She will be sorely missed by family and those of us who knew her.</p>"
  },
  {
    "header_value": "Capt. John M. Mayer",
    "photo": "",
    "date": "September 14, 1998",
    "body": "<p>\"The presence of that absence is Everywhere\"... Edna St. Vincent Millay </p><p>John learned to fly while serving in the US Air Force as an A/C Mechanic. He hired on with PSA in 1963, having previously flown cargo at Slick, World Airways and Pax with Hawaiian and Pacific Airlines. Retired since Nov 1993 from USAirways, John always maintained that his years with PSA were the BEST! He felt priviledged to have flown in the era of aviation that went from DC-3's to Fan Jets and to have known so many special people along the way. He lived the last four years with Parkinsons Disease with both courage and defiance. Constructing his new home \"Presssing on!\" until his sudden death from Multiple Pulmonary Emboli.... He truly died with \"His Boots on!\". His wife Joanne and children found that so many shared their loss with them. Their thanks are to remind everyone, just as John did...LIVE FOR TODAY!"
  },
  {
    "header_value": "Capt. William Krizan",
    "photo": "",
    "date": "",
    "body": ""
  },
  { "header_value": "Capt. David Ferrell", "photo": "", "date": "", "body": "" }
]
